In [1]:
import pandas as pd

In [2]:
students = pd.read_csv("../../datasets/StudentsPerformance.csv")

In [3]:
students.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [4]:
mathScore = students["math score"]

In [6]:
mathScore.head()

0    72
1    69
2    90
3    47
4    76
Name: math score, dtype: int64

In [7]:
type(students["math score"])

pandas.core.series.Series

In [8]:
students["math score"].shape

(1000,)

In [9]:
students

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [ ]:
mathScore_gender = students[["gender","math score","reading score","writing score"]]

In [12]:
mathScore_gender.head()

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75

In [13]:
type(students[["gender","math score"]])

pandas.core.frame.DataFrame

In [14]:
students[["gender","math score"]].shape

(1000, 2)

In [15]:
MathScore_50 = students[students["math score"] > 50]

In [ ]:
MathScore_50.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

In [17]:
students["math score"] > 50

0       True
1       True
2       True
3      False
4       True
       ...
995     True
996     True
997     True
998     True
999     True
Name: math score, Length: 1000, dtype: bool

In [20]:
MathScore_50.shape

(850, 8)

In [28]:
students[students["math score"].isin([50,60])]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
14,female,group A,master's degree,standard,none,50,53,58
37,female,group D,some high school,free/reduced,none,50,64,59
44,female,group E,associate's degree,free/reduced,none,50,56,54
67,female,group C,some college,standard,none,60,72,74
82,male,group A,some college,free/reduced,completed,50,47,54
103,male,group B,high school,standard,completed,60,44,47
157,male,group B,some college,free/reduced,none,60,60,60
182,female,group E,high school,standard,none,50,50,47
213,male,group C,associate's degree,free/reduced,completed,60,51,56
252,female,group B,some high school,standard,completed,60,70,70
396,female,group B,high school,free/reduced,none,50,67,63
399,male,group D,some high school,standard,none,60,59,54
435,male,group C,some college,free/reduced,completed,50,48,53
487,female,group C,associate's degree,free/reduced,none,60,75,74
573,female,group C,high school,free/reduced,completed,50,66,64
603,male,group D,high school,free/reduced,none,60,57,51
615,female,group C,high school,standard,none,60,68,72
648,female,group B,high school,standard,none,50,53,55
665,female,group C,some high school,free/reduced,completed,50,60,60
675,female,group B,some college,standard,completed,50,64,66
681,male,group B,high school,standard,none,60,68,60
714,female,group B,some high school,standard,completed,60,70,74
723,male,group C,high school,standard,none,50,48,42
748,female,group C,bachelor's degree,free/reduced,none,50,60,59
764,male,group D,some college,standard,none,60,63,59
791,female,group D,some college,free/reduced,none,60,66,70
818,female,group B,high school,free/reduced,none,60,72,68
835,female,group C,high school,standard,completed,60,64,74
892,female,group A,master's degree,free/reduced,none,50,67,73
910,male,group D,bachelor's degree,free/reduced,none,50,42,48
976,male,group B,some college,free/reduced,completed,60,62,60

In [29]:
students[(students["math score"] >= 50) & (students["math score"] <= 55)]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
14,female,group A,master's degree,standard,none,50,53,58
19,female,group C,associate's degree,free/reduced,none,54,58,61
37,female,group D,some high school,free/reduced,none,50,64,59
40,male,group C,associate's degree,free/reduced,none,55,61,54
42,female,group B,associate's degree,standard,none,53,58,65
...,...,...,...,...,...,...,...,...
945,female,group C,associate's degree,standard,none,54,61,58
972,female,group A,high school,free/reduced,completed,53,50,60
974,female,group A,some college,standard,none,54,63,67
978,male,group D,high school,standard,completed,55,41,48
992,female,group D,associate's degree,free/reduced,none,55,76,76

True si tiene valor

In [30]:
students[students["reading score"].notna()]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

True si esta vacio

In [32]:
students[students["reading score"].isna()]

Empty DataFrame
Columns: [gender, race/ethnicity, parental level of education, lunch, test preparation course, math score, reading score, writing score]
Index: []

In [36]:
students[students["test preparation course"] == "completed"]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
6,female,group B,some college,standard,completed,88,95,92
8,male,group D,high school,free/reduced,completed,64,64,67
13,male,group A,some college,standard,completed,78,72,70
18,male,group C,master's degree,free/reduced,completed,46,42,46
...,...,...,...,...,...,...,...,...
990,male,group E,high school,free/reduced,completed,86,81,75
991,female,group B,some high school,standard,completed,65,82,78
995,female,group E,master's degree,standard,completed,88,99,95
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77

In [ ]:
students["test preparation course"] == "completed"

0      False
1       True
2      False
3      False
4      False
       ...
995     True
996    False
997     True
998     True
999    False
Name: test preparation course, Length: 1000, dtype: bool

In [41]:
students[(students["math score"] <= 50) & (students["race/ethnicity"] == "group A")]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
14,female,group A,master's degree,standard,none,50,53,58
61,male,group A,some high school,free/reduced,none,39,39,34
72,female,group A,associate's degree,free/reduced,none,41,51,48
82,male,group A,some college,free/reduced,completed,50,47,54
250,male,group A,some high school,standard,completed,47,49,49
296,male,group A,some high school,standard,completed,46,41,43
327,male,group A,some college,free/reduced,none,28,23,19
365,male,group A,bachelor's degree,free/reduced,completed,49,58,60
368,female,group A,some high school,free/reduced,none,44,64,58
384,female,group A,some high school,free/reduced,none,38,43,43
395,male,group A,high school,free/reduced,none,48,45,41
402,female,group A,some college,free/reduced,none,49,65,55
433,female,group A,some high school,free/reduced,none,47,59,50
575,male,group A,associate's degree,free/reduced,completed,40,55,53
589,female,group A,some high school,standard,none,48,66,65
741,female,group A,associate's degree,free/reduced,none,37,57,56
811,male,group A,high school,free/reduced,none,45,47,49
816,female,group A,bachelor's degree,standard,none,45,59,64
892,female,group A,master's degree,free/reduced,none,50,67,73
902,female,group A,high school,free/reduced,completed,34,48,41
988,female,group A,some high school,free/reduced,none,44,45,45

In [43]:
groupA = students[students["race/ethnicity"] == "group A"]
groupA.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
13,male,group A,some college,standard,completed,78,72,70
14,female,group A,master's degree,standard,none,50,53,58
25,male,group A,master's degree,free/reduced,none,73,74,72
46,female,group A,associate's degree,standard,completed,55,65,62

In [69]:
filtro = students[students["test preparation course"] == "none"]
filtro.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78

In [70]:
filtro = students[(students["race/ethnicity"] == "group A") & (students["test preparation course"] == "none")]
filtro.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
14,female,group A,master's degree,standard,none,50,53,58
25,male,group A,master's degree,free/reduced,none,73,74,72
61,male,group A,some high school,free/reduced,none,39,39,34
62,male,group A,associate's degree,free/reduced,none,62,61,55

In [75]:
filtro = students.loc[students["math score"] < 30, "race/ethnicity"]
filtro.head()

17     group B
59     group C
91     group C
145    group C
327    group A
Name: race/ethnicity, dtype: object

In [110]:
filtro = students.iloc[9:25, 5:8]
filtro

    math score  reading score  writing score
9           38             60             50
10          58             54             52
11          40             52             43
12          65             81             73
13          78             72             70
14          50             53             58
15          69             75             78
16          88             89             86
17          18             32             28
18          46             42             46
19          54             58             61
20          66             69             63
21          65             75             70
22          44             54             53
23          69             73             73
24          74             71             80